; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph4 - mode
	infrared2 - mode
	image1 - mode
	infrared5 - mode
	thermograph0 - mode
	thermograph3 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star9 - direction
	GroundStation12 - direction
	Star13 - direction
	GroundStation8 - direction
	Star0 - direction
	Star11 - direction
	GroundStation10 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 image1)
	(supports instrument1 thermograph3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation10)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
)
(:goal (and
	(pointing satellite0 Star7)
	(have_image Planet14 infrared2)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon15 infrared5)
	(have_image Star16 image1)
	(have_image Star16 infrared5)
	(have_image Star17 spectrograph4)
))

)

; plan
1. (turn_to satellite0 groundstation10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation10)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation10)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 phenomenon15 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 7
5. (take_image satellite0 phenomenon15 instrument0 infrared5)
   added: (have_image phenomenon15 infrared5)
   goals met: 1 of 7
6. (take_image satellite0 phenomenon15 instrument0 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 2 of 7
7. (turn_to satellite0 groundstation10 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 groundstation10)
   goals met: 2 of 7
8. (turn_to satellite0 star16 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 star16)
   goals met: 2 of 7
9. (take_image satellite0 star16 instrument0 infrared5)
   added: (have_image star16 infrared5)
   goals met: 3 of 7
10. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 3 of 7
11. (take_image satellite0 star17 instrument0 spectrograph4)
   added: (have_image star17 spectrograph4)
   goals met: 4 of 7
12. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 7
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 7
14. (turn_to satellite0 planet14 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 planet14)
   goals met: 4 of 7
15. (turn_to satellite0 star11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star11)
   goals met: 4 of 7
16. (calibrate satellite0 instrument1 star11)
   added: (calibrated instrument1)
   goals met: 4 of 7
17. (turn_to satellite0 planet14 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet14)
   goals met: 4 of 7
18. (take_image satellite0 planet14 instrument1 infrared2)
   added: (have_image planet14 infrared2)
   goals met: 5 of 7
19. (turn_to satellite0 star16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star16)
   goals met: 5 of 7
20. (take_image satellite0 star16 instrument1 image1)
   added: (have_image star16 image1)
   goals met: 6 of 7
21. (turn_to satellite0 star7 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star7)
   goals met: 7 of 7
